package JavaSyntax.Level03.Lecture04;
/*Я так давно родился
Вывести на экран дату своего рождения в виде:
 */
public class IWasBornSoLongAgo {
    public static void main(String[] args) {
        System.out.println("APRIL 5 1986");
    }
}