package JavaSyntax.Level03.Lecture12;
/*Меркантильные намерения
Вывести на экран десять раз надпись "Я хочу большую зарплату, и для этого изучаю Java"
 */
public class MercantileIntentions {

    public static void main(String[] args) {
        //напишите тут ваш код
        for (int i = 0; i < 10; i++) {
            System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        }
    }
}