package JavaSyntax.Level01.Lecture03;
/*Выводим квадрат числа
Дана переменная number(она уже создана, к ней можно обращаться по имени с любого места программы).
Напиши программу, которая посчитает квадрат числа переменной number и выведет его на экран
*/
public class GetTheSquareOfANumber {
    public static int number = 25;

    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.println(number * number);
    }
}
